bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY85.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
  <variants>
    <variant ordercode="ATtiny85V-10PU" package="PDIP8" pinout="SOIC_8" speedmax="10000000" tempmax="85" tempmin="-40" vccmax="5.5" vccmin="1.8"/>
    <variant ordercode="ATtiny85V-10SU" package="SOIC8" pinout="SOIC_8" speedmax="10000000" tempmax="85" tempmin="-40" vccmax="5.5" vccmin="1.8"/>
    <variant ordercode="ATtiny85V-10SH" package="SOIC8" pinout="SOIC_8" speedmax="10000000" tempmax="85" tempmin="-40" vccmax="5.5" vccmin="1.8"/>
    <variant ordercode="ATtiny85V-10MU" package="MLF20" pinout="QFN_20" speedmax="10000000" tempmax="85" tempmin="-40" vccmax="5.5" vccmin="1.8"/>
    <variant ordercode="ATtiny85V-20PU" package="PDIP8" pinout="SOIC_8" speedmax="20000000" tempmax="85" tempmin="-40" vccmax="5.5" vccmin="2.7"/>
    <variant ordercode="ATtiny85V-20SU" package="SOIC8" pinout="SOIC_8" speedmax="20000000" tempmax="85" tempmin="-40" vccmax="5.5" vccmin="2.7"/>
    <variant ordercode="ATtiny85V-20SH" package="SOIC8" pinout="SOIC_8" speedmax="20000000" tempmax="85" tempmin="-40" vccmax="5.5" vccmin="2.7"/>
    <variant ordercode="ATtiny85V-20MU" package="MLF20" pinout="QFN_20" speedmax="20000000" tempmax="85" tempmin="-40" vccmax="5.5" vccmin="2.7"/>
  </variants>
  <devices>
    <device name="ATtiny85" architecture="AVR8" family="tinyAVR">
      <address-spaces>
        <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x2000">
          <memory-segment start="0x0000" size="0x2000" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x40"/>
        </address-space>
        <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
          <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
        </address-space>
        <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
          <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
        </address-space>
        <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
          <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
        </address-space>
        <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0260">
          <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
          <memory-segment name="MAPPED_IO" start="0x0020" size="0x0040" type="io" external="false"/>
          <memory-segment name="IRAM" start="0x0060" size="0x0200" type="ram" external="false"/>
        </address-space>
        <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0200">
          <memory-segment start="0x0000" size="0x0200" type="eeprom" rw="RW" exec="0" name="EEPROM" pagesize="0x04"/>
        </address-space>
        <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
        <address-space endianness="little" name="osccal" id="osccal" start="0" size="2">
          <memory-segment start="0" size="2" type="osccal" rw="R" exec="0" name="OSCCAL"/>
        </address-space>
      </address-spaces>
      <peripherals>
        <module name="PORT">
          <instance name="PORTB" caption="I/O Port">
            <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal function="PORTB" group="P" index="0" pad="PB0"/>
              <signal function="PORTB" group="P" index="1" pad="PB1"/>
              <signal function="PORTB" group="P" index="2" pad="PB2"/>
              <signal function="PORTB" group="P" index="3" pad="PB3"/>
              <signal function="PORTB" group="P" index="4" pad="PB4"/>
              <signal function="PORTB" group="P" index="5" pad="PB5"/>
            </signals>
          </instance>
        </module>
        <module name="AC">
          <instance name="AC" caption="Analog Comparator">
            <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data" caption="Analog Comparator"/>
            <signals>
              <signal function="ACIN" group="AIN" index="1" pad="PB1"/>
              <signal function="ACIN" group="AIN" index="0" pad="PB0"/>
            </signals>
          </instance>
        </module>
        <module name="ADC">
          <instance name="ADC" caption="Analog-to-Digital Converter">
            <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data" caption="Analog-to-Digital Converter"/>
            <signals>
              <signal function="ADC" group="ADC" index="0" pad="PB5"/>
              <signal function="ADC" group="ADC" index="1" pad="PB2"/>
              <signal function="ADC" group="ADC" index="2" pad="PB4"/>
              <signal function="AREF" group="AREF" pad="PB0"/>
            </signals>
          </instance>
        </module>
        <module name="USI">
          <instance name="USI" caption="Universal Serial Interface">
            <register-group name="USI" name-in-module="USI" offset="0x00" address-space="data" caption="Universal Serial Interface"/>
            <signals>
              <signal function="TWI" group="SDA" pad="PB0"/>
              <signal function="TWI" group="SCL" pad="PB2"/>
              <signal function="SPI" group="DI" pad="PB0"/>
              <signal function="SPI" group="DO" pad="PB1"/>
              <signal function="SPI" group="USCK" pad="PB2"/>
            </signals>
          </instance>
        </module>
        <module name="EXINT">
          <instance name="EXINT" caption="External Interrupts">
            <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
            <signals>
              <signal function="EXTINT" group="PCINT" index="0" pad="PB0"/>
              <signal function="EXTINT" group="PCINT" index="1" pad="PB1"/>
              <signal function="EXTINT" group="PCINT" index="2" pad="PB2"/>
              <signal function="EXTINT" group="PCINT" index="3" pad="PB3"/>
              <signal function="EXTINT" group="PCINT" index="4" pad="PB4"/>
              <signal function="EXTINT" group="PCINT" index="5" pad="PB5"/>
              <signal function="EXTINT" group="INT" index="0" pad="PB2"/>
            </signals>
          </instance>
        </module>
        <module name="EEPROM">
          <instance name="EEPROM" caption="EEPROM">
            <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
